# Foundation of Computer Science Project

In [212]:
#Import of the libraries
import pandas as pd
import numpy as np
import re


#Import and declarion of the main resources
users = pd.read_csv("Users.csv", sep=";",encoding = 'latin-1')
books = pd.read_csv("Books.csv", sep=";",encoding = 'latin-1',low_memory=False)
bookratings= pd.read_csv("Book-Ratings.csv", sep=";",encoding = 'latin-1')
goodbooks = pd.read_csv("goodbooks.csv", sep=",",encoding = 'latin-1')
goodratings = pd.read_csv("goodbooks-ratings.csv", sep=",",encoding = 'latin-1')

In [213]:
users.head()

   User-ID                            Location   Age
0        1                  nyc, new york, usa   NaN
1        2           stockton, california, usa  18.0
2        3     moscow, yukon territory, russia   NaN
3        4           porto, v.n.gaia, portugal  17.0
4        5  farnborough, hants, united kingdom   NaN

In [214]:
books.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...

In [186]:
bookratings.head()

   User-ID        ISBN  Book-Rating
0   276725  034545104X            0
1   276726  0155061224            5
2   276727  0446520802            0
3   276729  052165615X            3
4   276729  0521795028            6

In [187]:
goodbooks.head()

,book_id,goodreads_book_id,best_book_id,work_id,books_count,isbn,isbn13,authors,original_publication_year,original_title,...,ratings_count,work_ratings_count,work_text_reviews_count,ratings_1,ratings_2,ratings_3,ratings_4,ratings_5,image_url,small_image_url
0,1.0,2767052,2767052,2792775,272.0,439023483,9.780439e+12,Suzanne Collins,2008.0,The Hunger Games,...,4780653,4942365,155254.0,66715.0,127936.0,560092.0,1481305.0,2706317.0,https://images.gr-assets.com/books/1447303603m...,https://images.gr-assets.com/books/1447303603s...
1,2.0,3,3,4640799,491.0,439554934,9.780440e+12,"J.K. Rowling, Mary GrandPrÃ©",1997.0,Harry Potter and the Philosopher's Stone,...,4602479,4800065,75867.0,75504.0,101676.0,455024.0,1156318.0,3011543.0,https://images.gr-assets.com/books/1474154022m...,https://images.gr-assets.com/books/1474154022s...
2,3.0,41865,41865,3212258,226.0,316015849,9.780316e+12,Stephenie Meyer,2005.0,Twilight,...,3866839,3916824,95009.0,456191.0,436802.0,793319.0,875073.0,1355439.0,https://images.gr-assets.com/books/1361039443m...,https://images.gr-assets.com/books/1361039443s...
3,4.0,2657,2657,3275794,487.0,61120081,9.780061e+12,Harper Lee,1960.0,To Kill a Mockingbird,...,3198671,3340896,72586.0,60427.0,117415.0,446835.0,1001952.0,1714267.0,https://images.gr-assets.com/books/1361975680m...,https://images.gr-assets.com/books/1361975680s...
4,5.0,4671,4671,245494,1356.0,743273567,9.780743e+12,F. Scott Fitzgerald,1925.0,The Great Gatsby,...,2683664,2773745,51992.0,86236.0,197621.0,606158.0,936012.0,947718.0,https://images.gr-assets.com/books/1490528560m...,https://images.gr-assets.com/books/1490528560s...

In [188]:
goodratings.head()

   user_id  book_id  rating
0        1      258       5
1        2     4081       4
2        2      260       5
3        2     9296       5
4        2     2318       3

## 1. Normalize the location field of Users dataset, splitting into city, region, country.

In [189]:
#Using Regex to normalize the location field
users['City'] = users['Location'].str.extract('(.*?),')
users['Region'] = users['Location'].str.extract(',\s(.*?),')
users['State'] = users['Location'].str.extract('\s(\w+)$')

In [190]:
users.head()

,User-ID,Location,Age,City,Region,State
0,1,"nyc, new york, usa",NaN,nyc,new york,usa
1,2,"stockton, california, usa",18.0,stockton,california,usa
2,3,"moscow, yukon territory, russia",NaN,moscow,yukon territory,russia
3,4,"porto, v.n.gaia, portugal",17.0,porto,v.n.gaia,portugal
4,5,"farnborough, hants, united kingdom",NaN,farnborough,hants,kingdom

 ## 2. For each book in the Books dataset, compute its average rating.

In [191]:
#This answer referes to the average rating for the specific book i.e the tuple(ISBN, Title, avgrating)
rating = pd.merge(books,bookratings,how = 'left',on='ISBN').groupby(["ISBN","Book-Title"],as_index=False)["Book-Rating"].mean()
rating.rename(columns={'Book-Rating': 'AvgRating'},inplace=True)
rating

,ISBN,Book-Title,AvgRating
0,0000913154,The Way Things Work: An Illustrated Encycloped...,8.0
1,0001010565,Mog's Christmas,0.0
2,0001046438,Liar,9.0
3,0001046713,Twopence to Cross the Mersey,0.0
4,000104687X,"T.S. Eliot Reading \The Wasteland\"" and Other ...",6.0
...,...,...,...
271354,B000234N76,Falling Angels,0.0
271355,B000234NC6,It Must've Been Something I Ate: The Return of...,0.0
271356,B00029DGGO,"Good Wife Strikes Back, The",0.0
271357,B0002JV9PY,The Blockade Runners,0.0
271358,B0002K6K8O,The Underground City,0.0

In [192]:
#This solution is more generic and refers to the book i.e. the tuple(Title,avgRating)
rating_title = pd.merge(books,bookratings,how = 'left',on='ISBN')
rating_title.rename(columns={'Book-Rating': 'AvgRating'},inplace=True)
rating_title[["Book-Title","AvgRating"]].groupby("Book-Title",as_index=False)["AvgRating"].mean()

                                               Book-Title  AvgRating
0        A Light in the Storm: The Civil War Diary of ...   2.250000
1                                   Always Have Popsicles   0.000000
2                    Apple Magic (The Collector's series)   0.000000
3        Ask Lily (Young Women of Faith: Lily Series, ...   8.000000
4        Beyond IBM: Leadership Marketing and Finance ...   0.000000
...                                                   ...        ...
242129                                    Ã?Ã?lpiraten.   0.000000
242130                   Ã?Ã?rger mit Produkt X. Roman.   5.250000
242131                              Ã?Ã?sterlich leben.   7.000000
242132                            Ã?Ã?stlich der Berge.   2.666667
242133                                Ã?Ã?thique en toc   4.000000

[242134 rows x 2 columns]

## 3. For each book in the GoodBooks dataset, compute its average rating.

In [193]:
goodbooks[['isbn','original_title','average_rating']]

          isbn                            original_title  average_rating
0    439023483                          The Hunger Games            4.34
1    439554934  Harry Potter and the Philosopher's Stone            4.44
2    316015849                                  Twilight            3.57
3     61120081                     To Kill a Mockingbird            4.25
4    743273567                          The Great Gatsby            3.89
..         ...                                       ...             ...
95   375751513                The Picture of Dorian Gray            4.06
96   345803507                        Fifty Shades Freed            3.88
97   393970124                                   Dracula            3.98
98   307269981               Flickan som lekte med elden            4.22
99  1612130585                       Fifty Shades Darker            3.87

[100 rows x 3 columns]

## 4. Merge together all rows sharing the same book title, author and publisher. We will call the resulting datset merged books. The books that have not been merged together will not appear in merged books.

In [194]:
#We interpreter this question as all books that share the same: Title, Author and Publisher
#The simpliest solution consists only in a drop of all duplicates and the retain of the first copy
merged_books = books.drop_duplicates(subset=['Book-Title','Book-Author','Publisher'])
merged_books.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...

## 5. For each book in merged books compute its average rating.

In [195]:
#As for question n°2, we assume that the avg. rating is refererred to the specific book as the tuple(ISBN,Title,AvgRating)
merged_books_rating = pd.merge(merged_books,rating,on=['ISBN','Book-Title'],how="left")
merged_books_rating[['ISBN','Book-Title','AvgRating']]

,ISBN,Book-Title,AvgRating
0,0195153448,Classical Mythology,0.000000
1,0002005018,Clara Callan,4.928571
2,0060973129,Decision in Normandy,5.000000
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,4.272727
4,0393045218,The Mummies of Urumchi,0.000000
...,...,...,...
266125,0440400988,There's a Bat in Bunk Five,7.000000
266126,0525447644,From One to One Hundred,4.000000
266127,006008667X,Lily Dale : The True Story of the Town that Ta...,0.000000
266128,0192126040,Republic (World's Classics),0.000000
266129,0767409752,A Guided Tour of Rene Descartes' Meditations o...,0.000000

In [196]:
#If we consider the tuple(Title,avgRating) for merged_books
merged_books_rating2 = merged_books_rating = pd.merge(merged_books,rating_title,on=['Book-Title'],how="left")
merged_books_rating2[['Book-Title','AvgRating']].groupby("Book-Title",as_index=False)['AvgRating'].mean()

                                               Book-Title  AvgRating
0        A Light in the Storm: The Civil War Diary of ...   2.250000
1                                   Always Have Popsicles   0.000000
2                    Apple Magic (The Collector's series)   0.000000
3        Ask Lily (Young Women of Faith: Lily Series, ...   8.000000
4        Beyond IBM: Leadership Marketing and Finance ...   0.000000
...                                                   ...        ...
242129                                    Ã?Ã?lpiraten.   0.000000
242130                   Ã?Ã?rger mit Produkt X. Roman.   5.250000
242131                              Ã?Ã?sterlich leben.   7.000000
242132                            Ã?Ã?stlich der Berge.   2.666667
242133                                Ã?Ã?thique en toc   4.000000

[242134 rows x 2 columns]

## 6. For each book in merged books compute the minimum and maximum of the average ratings over all corresponding books in the books dataset.

In [197]:
#for every book(Title,Rating), his minimum average rating
min_avg_rating =merged_books_rating2.groupby("Book-Title",as_index=False)["AvgRating"].min()
#for every book(Title,Rating), his maximum average rating
max_avg_rating =merged_books_rating2.groupby("Book-Title",as_index=False)["AvgRating"].max()
#merge 
maxmin_avg = pd.merge(min_avg_rating,max_avg_rating,on="Book-Title",suffixes=("_Min", "_Max"))
maxmin_avg.head()

,Book-Title,AvgRating_Min,AvgRating_Max
0,A Light in the Storm: The Civil War Diary of ...,0.0,9.0
1,Always Have Popsicles,0.0,0.0
2,Apple Magic (The Collector's series),0.0,0.0
3,"Ask Lily (Young Women of Faith: Lily Series, ...",8.0,8.0
4,Beyond IBM: Leadership Marketing and Finance ...,0.0,0.0

## 7. For each book in goodbooks, compute the list of its authors. Assuming that the number of reviews with a text (column work_text_reviews_count) is split equally among all authors, find for each authors the total number of reviews with a text. We will call this quantity the shared number of reviews with a text.

In [198]:
#First let's retrieve a clean list of all authors
clean_df = goodbooks['authors'].str.split(',', expand = True)
clean_df["shared_review_text"] = goodbooks['work_text_reviews_count'].values
clean_df.tail()

,0,1,2,3,4,shared_review_text
95,Oscar Wilde,Jeffrey Eugenides,None,None,None,19647.0
96,E.L. James,None,None,None,None,25287.0
97,Bram Stoker,Nina Auerbach,David J. Skal,None,None,17263.0
98,Stieg Larsson,Reg Keeland,None,None,None,31423.0
99,E.L. James,None,None,None,None,28052.0

In [199]:
#We divide authors by chunks

a1 = clean_df[[0,'shared_review_text']]
a1.dropna(inplace=True)

a2 = clean_df[[1,'shared_review_text']]
a2.dropna(inplace=True)

a3 = clean_df[[2,'shared_review_text']]
a3.dropna(inplace=True)

a4 = clean_df[[3,'shared_review_text']]
a4.dropna(inplace=True)

a5 = clean_df[[4,'shared_review_text']]
a5.dropna(inplace=True)

#renaming chunks for an easier concatenation
a2.rename(columns={1: 0},inplace=True)
a3.rename(columns={2: 0},inplace=True)
a4.rename(columns={3: 0},inplace=True)
a5.rename(columns={4: 0},inplace=True)

<ipython-input-199-5504c6c37341>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  a1.dropna(inplace=True)
<ipython-input-199-5504c6c37341>:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  a2.dropna(inplace=True)
<ipython-input-199-5504c6c37341>:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  a3.dropna(inplace=True)
<ipython-input-199-5504c6c37341>:13: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  a4.dropna(inplace=True)
<ipython-input-199-5504c6c37341>:16: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  a5.dropna(inplace=True)
/opt/anaconda3/lib/python3.8/site-packages/pandas/core/frame.py:4441: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().rename(

In [200]:
#We concatanete the chunks and summarize the results
authorsharedreview = pd.concat([a1,a2,a3,a4,a5])
authorsharedreview.rename(columns={0:"author"},inplace=True)
authorsharedreview.groupby('author')['shared_review_text'].sum()
print(authorsharedreview)

                   author  shared_review_text
0         Suzanne Collins            155254.0
1            J.K. Rowling             75867.0
2         Stephenie Meyer             95009.0
3              Harper Lee             72586.0
4     F. Scott Fitzgerald             51992.0
..                    ...                 ...
83   Hablot Knight Browne             13093.0
97          David J. Skal             17263.0
79      FrÃ©dÃ©ric Mugler              8101.0
80       Melina Karakosta             24537.0
79           Bernard Knox              8101.0

[139 rows x 2 columns]

## 8. For each year of publication, determine the author that has the largest value of the shared number of reviews with a text.

In [201]:
#For this problem we'll recycle the same methodology as the previuos one
#We duplicate our precedent answer
clean_df2 =clean_df
#We add another column for the Year
clean_df2['Year']= goodbooks['original_publication_year'].values
clean_df2.head()

,0,1,2,3,4,shared_review_text,Year
0,Suzanne Collins,None,None,None,None,155254.0,2008.0
1,J.K. Rowling,Mary GrandPrÃ©,None,None,None,75867.0,1997.0
2,Stephenie Meyer,None,None,None,None,95009.0,2005.0
3,Harper Lee,None,None,None,None,72586.0,1960.0
4,F. Scott Fitzgerald,None,None,None,None,51992.0,1925.0

In [202]:
a1bis = clean_df2[[0,'shared_review_text','Year']]
a1bis.dropna(inplace=True)


a2bis = clean_df2[[1,'shared_review_text','Year']]
a2bis.dropna(inplace=True)

a3bis = clean_df2[[2,'shared_review_text','Year']]
a3bis.dropna(inplace=True)

a4bis = clean_df2[[3,'shared_review_text','Year']]
a4bis.dropna(inplace=True)

a5bis = clean_df2[[4,'shared_review_text','Year']]
a5bis.dropna(inplace=True)

#renaming chunks for an easier concatenation
a2bis.rename(columns={1: 0},inplace=True)
a3bis.rename(columns={2: 0},inplace=True)
a4bis.rename(columns={3: 0},inplace=True)
a5bis.rename(columns={4: 0},inplace=True)

<ipython-input-202-695e15a6d532>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  a1bis.dropna(inplace=True)
<ipython-input-202-695e15a6d532>:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  a2bis.dropna(inplace=True)
<ipython-input-202-695e15a6d532>:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  a3bis.dropna(inplace=True)
<ipython-input-202-695e15a6d532>:12: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  a4bis.dropna(inplace=True)
<ipython-input-202-695e15a6d532>:15: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  a5bis.dropna(inplace=True)
/opt/anaconda3/lib/python3.8/site-packages/pandas/core/frame.py:4441: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().rename(

In [203]:
#We concatenate and sum the columns with common values
yearreview = pd.concat([a1bis,a2bis,a3bis,a4bis,a5bis])
yearreview.rename(columns={0:"author"},inplace=True)
groupedyear = yearreview.groupby(["author","Year"],as_index=False)['shared_review_text'].sum()
groupedyear.head()

                     author    Year  shared_review_text
0            Alan R. Clarke  1988.0             55781.0
1   B.M. Mooyaart-Doubleday  1947.0             20825.0
2              Bernard Knox  -720.0              8101.0
3             CelÃ¢l Ãster  1949.0             45518.0
4             David J. Skal  1897.0             17263.0

In [204]:
#Finally we group and find the max for each year
#This solution takes as max the first value that finds 
yearmaxreview=groupedyear.groupby("Year",as_index=False).max()
yearmaxreview.head()

     Year                       author  shared_review_text
0  -720.0                        Homer              8101.0
1  1595.0          William Shakespeare             14778.0
2  1811.0                  Jane Austen             11526.0
3  1813.0                  Jane Austen             49152.0
4  1818.0  Mary Wollstonecraft Shelley             19993.0

## 9. Assuming that there are no errors in the ISBN fields, find the books in both datasets, and compute the difference of average rating according to the ratings and the goodratings datasets

In [205]:
#We first  take a subset of columns from goodbooks
subset = goodbooks[['isbn','original_title','average_rating']]
subset.rename(columns={"isbn":"ISBN"},inplace=True)
subset

/opt/anaconda3/lib/python3.8/site-packages/pandas/core/frame.py:4441: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().rename(

          ISBN                            original_title  average_rating
0    439023483                          The Hunger Games            4.34
1    439554934  Harry Potter and the Philosopher's Stone            4.44
2    316015849                                  Twilight            3.57
3     61120081                     To Kill a Mockingbird            4.25
4    743273567                          The Great Gatsby            3.89
..         ...                                       ...             ...
95   375751513                The Picture of Dorian Gray            4.06
96   345803507                        Fifty Shades Freed            3.88
97   393970124                                   Dracula            3.98
98   307269981               Flickan som lekte med elden            4.22
99  1612130585                       Fifty Shades Darker            3.87

[100 rows x 3 columns]

In [206]:
#We merge together the subset with our dataframe of average ratings of all books
diff = pd.merge(subset,rating,on="ISBN",how="left")
diff['diff'] = diff['average_rating'] - diff['AvgRating']
diff.head()

,ISBN,original_title,average_rating,Book-Title,AvgRating,diff
0,439023483,The Hunger Games,4.34,NaN,NaN,NaN
1,439554934,Harry Potter and the Philosopher's Stone,4.44,NaN,NaN,NaN
2,316015849,Twilight,3.57,NaN,NaN,NaN
3,61120081,To Kill a Mockingbird,4.25,NaN,NaN,NaN
4,743273567,The Great Gatsby,3.89,NaN,NaN,NaN

In [207]:
#For visualization purposes we show only the matched values
temp = diff.dropna(subset=["diff"])
results = temp[["ISBN","original_title","Book-Title","average_rating","AvgRating","diff"]]
results.head(10)

,ISBN,original_title,Book-Title,average_rating,AvgRating,diff
10,1594480001,The Kite Runner,The Kite Runner,4.26,2.400000,1.860000
17,043965548X,Harry Potter and the Prisoner of Azkaban,Harry Potter and the Prisoner of Azkaban (Harr...,4.53,3.533333,0.996667
60,1400032717,The Curious Incident of the Dog in the Night-Time,The Curious Incident of the Dog in the Night-T...,3.85,4.813187,-0.963187
75,014028009X,NaN,Bridget Jones's Diary,3.75,3.751852,-0.001852
90,014038572X,The Outsiders,The Outsiders (Now in Speak!),4.06,4.460674,-0.400674

## 10. Split the users dataset according to the age. One dataset contains the users with unknown age, one with age 0-14, one with age 15-24, one with age 25-34, and so on.

In [215]:
#For solving this problem we'll proceed as follow:
#1.We'll create a series of bin which rappresent the different ranges
#2.We'll insert the rows in the corresponding bins

In [221]:
#We start creating the bins in which we'll store our values
bins = np.arange(start=0, stop=users["Age"].max()+1, step=15)
ind = np.digitize(users['Age'], bins)

In [222]:
#We introduce the bin null which will contain the nan values of Age
null = users[users['Age'].isnull()]
users_copy = users
#we drop the nan values from users[Age] so they won't be inserted into the bins 
users_copy.dropna(subset=["Age"],inplace=True)

In [223]:
#We proceed now with inserting all the row sorting by the bins
container = {}
for age, group in users_copy.groupby(ind,as_index=False):
    container['group_' + str(age)] = group
container

{'group_1':         User-ID                           Location   Age
 10           11     melbourne, victoria, australia  14.0
 18           19                          weston, ,  14.0
 40           41            santee, california, usa  14.0
 119         120    villeneuve d`ascq, nord, france  13.0
 219         220           bogota, bogota, colombia   0.0
 ...         ...                                ...   ...
 278574   278575  burnaby, british columbia, canada  14.0
 278582   278583              steele, missouri, usa  13.0
 278668   278669          spring hill, fl, hernando  13.0
 278751   278752        london, nova scotia, canada   9.0
 278793   278794           st. paul, minnesota, usa  14.0

 [4313 rows x 3 columns],
 'group_2':         User-ID                                Location   Age
 1             2               stockton, california, usa  18.0
 3             4               porto, v.n.gaia, portugal  17.0
 9            10              albacete, wisconsin, spain  26.0
 12           13             barcelona, barcelona, spain  26.0
 17           18  rio de janeiro, rio de janeiro, brazil  25.0
 ...         ...                                     ...   ...
 278842   278843            pismo beach, california, usa  28.0
 278843   278844                st. paul, minnesota, usa  28.0
 278845   278846                toronto, ontario, canada  23.0
 278848   278849             georgetown, ontario, canada  23.0
 278852   278853          stranraer, n/a, united kingdom  17.0

 [67189 rows x 3 columns],
 'group_3':         User-ID                                 Location   Age
 26           27                   chicago, illinois, usa  32.0
 32           33              costa mesa, california, usa  34.0
 37           38                    viterbo, lazio, italy  34.0
 39           40                 tonawanda, new york, usa  32.0
 45           46  heidelberg, baden-wuerttemberg, germany  31.0
 ...         ...                                      ...   ...
 278818   278819               surfside beach, texas, usa  32.0
 278821   278822                      soria, soria, spain  30.0
 278823   278824                 madison, new jersey, usa  41.0
 278850   278851                       dallas, texas, usa  33.0
 278851   278852          brisbane, queensland, australia  32.0

 [56269 rows x 3 columns],
 'group_4':         User-ID                             Location   Age
 20           21       ferrol / spain, alabama, spain  46.0
 24           25             oakland, california, usa  55.0
 43           44  black mountain, north carolina, usa  51.0
 62           63                 nyack, new york, usa  57.0
 88           89                    plano, texas, usa  54.0
 ...         ...                                  ...   ...
 278814   278815                portland, oregon, usa  56.0
 278819   278820      ninety six, south carolina, usa  59.0
 278835   278836          des moines, washington, usa  47.0
 278839   278840           encinitas, california, usa  45.0
 278854   278855   tacoma, washington, united kingdom  50.0

 [31131 rows x 3 columns],
 'group_5':         User-ID                                Location   Age
 5             6           santa monica, california, usa  61.0
 143         144           cape girardeau, missouri, usa  62.0
 147         148          essex, england, united kingdom  63.0
 164         165                olympia, washington, usa  62.0
 171         172  rio de janeiro, rio de janeiro, brazil  66.0
 ...         ...                                     ...   ...
 278806   278807          pollock pines, california, usa  66.0
 278809   278810     perth, western australia, australia  62.0
 278816   278817                    urbandale, iowa, usa  60.0
 278820   278821                 clarence, new york, usa  70.0
 278831   278832          new smyrna beach, florida, usa  62.0

 [8110 rows x 3 columns],
 'group_6':         User-ID                                      Location   Age
 220         221                      palm beach, florida, usa  79.0
 689         690                      lake oswego, oregon, usa  80.0
 957         958                           lindale, texas, usa  78.0
 1147       1148                  prairie village, kansas, usa  79.0
 1485       1486              montmorency, victoria, australia  75.0
 ...         ...                                           ...   ...
 275616   275617                         namur, namur, belgium  81.0
 278317   278318                  studio city, california, usa  77.0
 278348   278349                           carlin, nevada, usa  76.0
 278412   278413                    kansas city, missouri, usa  76.0
 278471   278472  biel-benken bl/schweiz, alabama, switzerland  81.0

 [649 rows x 3 columns],
 'group_7':         User-ID                                   Location    Age
 1288       1289                  san jose, california, usa  103.0
 1322       1323                   milano, lombardia, italy  104.0
 3084       3085          zÃ¼rich, switzerland, switzerland  104.0
 3436       3437                      honolulu, hawaii, usa  103.0
 3688       3689                       vigo, galicia, spain  104.0
 ...         ...                                        ...    ...
 276352   276353                   hillsdale, new york, usa  104.0
 277107   277108                quinto, ticino, switzerland  104.0
 277503   277504                 san diego, california, usa  103.0
 277558   277559                 lake george, new york, usa   98.0
 278301   278302  dÃ¼sseldorf, nordrhein-westfalen, germany  104.0

 [327 rows x 3 columns],
 'group_8':         User-ID                                   Location    Age
 3210       3211    le mesnil saint denis, yvelines, france  119.0
 8329       8330        newcastle, thenorth, united kingdom  114.0
 32655     32656                 boston, massachusetts, usa  110.0
 80532     80533                7dfgfdv56, bremen, alderney  106.0
 86588     86589                      lagos, lagos, nigeria  108.0
 95863     95864                       edinburgh, scotland,  108.0
 97245     97246                 woburn, massachusetts, usa  106.0
 123169   123170         sydeny, new south wales, australia  114.0
 142792   142793                      napa, california, usa  114.0
 150860   150861                baton rouge, louisiana, usa  116.0
 155586   155587               thailand, thailand, thailand  106.0
 160863   160864                      reston, virginia, usa  116.0
 161428   161429                bermigham, connecticut, usa  115.0
 165351   165352                      ojai, california, usa  108.0
 178615   178616                   burbank, california, usa  109.0
 179568   179569                      buch, berlin, germany  105.0
 180574   180575              gulyai-polye, rostov, ukraine  115.0
 200719   200720           london, colorado, united kingdom  106.0
 212515   212516                   lisboa, lisboa, portugal  113.0
 216891   216892  skeyton, norwich, england, united kingdom  107.0
 222659   222660                      opelika, alabama, usa  114.0
 224633   224634           fuerteventura, las palmas, spain  111.0
 224763   224764                  rockaway, new jersey, usa  116.0
 225172   225173                       haifa, haifa, israel  115.0
 227814   227815                   nowhere, new jersey, usa  118.0
 231945   231946                 san diego, california, usa  116.0
 250633   250634                  singapore, n/a, singapore  114.0
 257177   257178                     polonia, idaho, bhutan  105.0
 263066   263067      villa gesell, buenos aires, argentina  113.0
 266534   266535                     lizvill, arkansas, usa  116.0,
 'group_9':         User-ID                                 Location    Age
 17902     17903        antiqua, n/a, antigua and barbuda  123.0
 24410     24411                   pirkkala, n/a, finland  133.0
 27717     27718                blublub city, n/a, belize  123.0
 28090     28091              fort collins, colorado, usa  128.0
 41383     41384           london, london, united kingdom  124.0
 48280     48281  palmerston north, manawatu, new zealand  124.0
 50768     50769        glasgow, scotland, united kingdom  133.0
 73698     73699                     zaragoza, n/a, spain  123.0
 83882     83883                  danang, danang, vietnam  123.0
 85846     85847                   shanghai, texas, china  123.0
 86720     86721   santiago de compostela, galicia, spain  124.0
 122559   122560         montreuil sous bois, n/a, france  132.0
 146284   146285               ariege, montsegur, rosello  123.0
 217550   217551              barcelona, catalunya, spain  124.0
 221391   221392                    tallinn, n/a, estonia  123.0
 225525   225526                     kamuela, hawaii, usa  124.0
 245084   245085                    succ, new jersey, usa  123.0
 276047   276048                      wien, wien, austria  127.0,
 'group_10':         User-ID                                   Location    Age
 11325     11326        johannesburg, gauteng, south africa  148.0
 30589     30590  cambridge, cambridgeshire, united kingdom  141.0
 35860     35861                   barneveld, new york, usa  148.0
 46263     46264            london, england, united kingdom  141.0
 71799     71800                 sunnyvale, california, usa  136.0
 90765     90766                    rangoon, rangoon, burma  136.0
 96713     96714      ponte vedra, festa da lÃ­ngua, galiza  141.0
 103246   103247                         austin, texas, usa  148.0
 104815   104816                       iowa city, iowa, usa  147.0
 121725   121726        balmain, new south wales, australia  148.0
 165823   165824      marsfield, new south wales, australia  137.0
 173018   173019         victoria, british columbia, canada  138.0
 184948   184949         voorhees township, new jersey, usa  147.0
 196035   196036             san francisco, california, usa  148.0
 225959   225960               babenhausen, hessen, germany  146.0
 261553   261554                      arak, tennessee, iran  143.0
 264933   264934                      madrid, madrid, spain  140.0,
 'group_11':         User-ID                                Location    Age
 12691     12692              jacksonville, florida, usa  151.0
 61103     61104                     largo, florida, usa  162.0
 63665     63666                  kearney, missouri, usa  156.0
 101667   101668  stuttgart, baden-wuerttemberg, germany  151.0
 126167   126168          hoffman estates, illinois, usa  159.0
 136356   136357               puyallup, washington, usa  152.0
 218682   218683                  ceres, california, usa  157.0,
 'group_12':         User-ID                Location    Age
 45688     45689     wolwich, maine, usa  175.0
 48098     48099  genova, liguria, italy  172.0
 119281   119282  chicago, illinois, usa  168.0,
 'group_13':         User-ID                           Location    Age
 132667   132668            bucharest, n/a, romania  186.0
 183332   183333          granada, andalucia, spain  183.0
 275582   275583  koblenz, rheinland-pfalz, germany  189.0,
 'group_14':         User-ID                                 Location    Age
 13272     13273            harrisburg, pennsylvania, usa  201.0
 52471     52472                frisco/dallas, texas, usa  209.0
 76864     76865        arrasate, gipuzkoa, euskal herria  209.0
 102627   102628                  the dalles, oregon, usa  199.0
 160894   160895     haddington, scotland, united kingdom  200.0
 163654   163655                 langenfeld, nrw, germany  199.0
 168716   168717               rochester, washington, usa  207.0
 184860   184861               fort morgan, colorado, usa  204.0
 190646   190647      fode-te ai porco, raffah, palestine  204.0
 210012   210013       sydney, new south wales, australia  204.0
 216665   216666    christchurch, canterbury, new zealand  208.0
 226615   226616                     tucson, arizona, usa  204.0
 257429   257430  reutlingen, baden-wuerttemberg, germany  200.0,
 'group_15':         User-ID                               Location    Age
 37834     37835          dunbarton, new hampshire, usa  219.0
 52648     52649    vancouver, british columbia, canada  212.0
 92857     92858         melbourne, victoria, australia  210.0
 156353   156354              hamburg, hamburg, germany  210.0
 211520   211521  santa maria da feira, porto, portugal  223.0
 245230   245231           christchurch, canterbury, nz  220.0
 257113   257114            glen ridge, new jersey, usa  210.0,
 'group_16':         User-ID                      Location    Age
 1578       1579  akure, ondo/nigeria, nigeria  231.0
 8457       8458      milano, lombardia, italy  230.0
 8781       8782      calgary, alberta, canada  239.0
 58285     58286            midvale, utah, usa  237.0
 163826   163827        olympia, cascadia, usa  226.0
 172057   172058       lake mary, florida, usa  229.0
 182769   182770        las vegas, nevada, usa  228.0
 192412   192413      elverta, california, usa  228.0
 242213   242214         golden, colorado, usa  228.0,
 'group_17':        User-ID                                Location    Age
 20856    20857  stuttgart, baden-wuerttemberg, germany  244.0}

 ## 11. Find the books that appear only in the goodbooks datasets.

In [224]:
#We'll search for the isbn 
cond = goodbooks['isbn'].isin(books['ISBN'])
unique_books= goodbooks.drop(goodbooks[cond].index)

In [225]:
unique_books.head()

,book_id,goodreads_book_id,best_book_id,work_id,books_count,isbn,isbn13,authors,original_publication_year,original_title,...,ratings_count,work_ratings_count,work_text_reviews_count,ratings_1,ratings_2,ratings_3,ratings_4,ratings_5,image_url,small_image_url
0,1.0,2767052,2767052,2792775,272.0,439023483,9.780439e+12,Suzanne Collins,2008.0,The Hunger Games,...,4780653,4942365,155254.0,66715.0,127936.0,560092.0,1481305.0,2706317.0,https://images.gr-assets.com/books/1447303603m...,https://images.gr-assets.com/books/1447303603s...
1,2.0,3,3,4640799,491.0,439554934,9.780440e+12,"J.K. Rowling, Mary GrandPrÃ©",1997.0,Harry Potter and the Philosopher's Stone,...,4602479,4800065,75867.0,75504.0,101676.0,455024.0,1156318.0,3011543.0,https://images.gr-assets.com/books/1474154022m...,https://images.gr-assets.com/books/1474154022s...
2,3.0,41865,41865,3212258,226.0,316015849,9.780316e+12,Stephenie Meyer,2005.0,Twilight,...,3866839,3916824,95009.0,456191.0,436802.0,793319.0,875073.0,1355439.0,https://images.gr-assets.com/books/1361039443m...,https://images.gr-assets.com/books/1361039443s...
3,4.0,2657,2657,3275794,487.0,61120081,9.780061e+12,Harper Lee,1960.0,To Kill a Mockingbird,...,3198671,3340896,72586.0,60427.0,117415.0,446835.0,1001952.0,1714267.0,https://images.gr-assets.com/books/1361975680m...,https://images.gr-assets.com/books/1361975680s...
4,5.0,4671,4671,245494,1356.0,743273567,9.780743e+12,F. Scott Fitzgerald,1925.0,The Great Gatsby,...,2683664,2773745,51992.0,86236.0,197621.0,606158.0,936012.0,947718.0,https://images.gr-assets.com/books/1490528560m...,https://images.gr-assets.com/books/1490528560s...

## 12. Assuming that each pair (author, title) identifies a book, for each book find the number of times it appears in the books dataset. Which books appear the most times?

In [226]:
goodbooks_merge = pd.merge(goodbooks_subset,books,how="left",left_on=["original_title","authors"],right_on=["Book-Title","Book-Author"])
occ = goodbooks_merge.groupby(["authors","original_title"],as_index=False)['isbn'].count()
occ.rename(columns={'isbn': 'count'},inplace=True)
occ

,authors,original_title,count
0,31084,20210,1
1,Aldous Huxley,Brave New World,5
2,Alice Sebold,The Lovely Bones,4
3,"Anne Frank, Eleanor Roosevelt, B.M. Mooyaart-D...",Het Achterhuis: Dagboekbrieven 14 juni 1942 - ...,1
4,"Antoine de Saint-ExupÃ©ry, Richard Howard, Dom...",Le Petit Prince,1
...,...,...,...
93,Veronica Roth,Insurgent,1
94,William Golding,Lord of the Flies,1
95,William Goldman,The Princess Bride,1
96,"William Shakespeare, Robert Jackson",An Excellent conceited Tragedie of Romeo and J...,1
97,Yann Martel,Life of Pi,4

In [227]:
occ[occ['count'] == occ['count'].max()]

              authors original_title  count
59  Louisa May Alcott   Little Women     21

## 13. Find the author with the highest average rating according to the goodbooks datasets.

In [228]:
#We already had retrieved the list of all authors in goodbooks
authors = authorsharedreview["author"]
authors.head()

0        Suzanne Collins
1           J.K. Rowling
2        Stephenie Meyer
3             Harper Lee
4    F. Scott Fitzgerald
Name: author, dtype: object

In [229]:
#We assign for each author the highest average rating in goodbooks
dict_authors={}
for a in authors:
    for aut in goodbooks["authors"].values:
        if str(aut).find(a):
            dict_authors[a] = goodbooks[goodbooks["authors"]==aut]["average_rating"].max()
dict_authors

{'Suzanne Collins': 3.88,
 'J.K. Rowling': 3.88,
 'Stephenie Meyer': 3.88,
 'Harper Lee': 3.88,
 'F. Scott Fitzgerald': 3.88,
 'John Green': 3.88,
 'J.R.R. Tolkien': 3.88,
 'J.D. Salinger': 3.88,
 'Dan Brown': 3.88,
 'Jane Austen': 3.88,
 'Khaled Hosseini': 3.88,
 'Veronica Roth': 3.88,
 'George Orwell': 3.88,
 'Anne Frank': 3.88,
 'Stieg Larsson': 3.88,
 'Alice Sebold': 3.88,
 'William Golding': 3.88,
 'William Shakespeare': 3.88,
 'Gillian Flynn': 3.88,
 'Kathryn Stockett': 3.88,
 'John Steinbeck': 3.88,
 'Arthur Golden': 3.88,
 'E.L. James': 4.22,
 'Paulo Coelho': 3.88,
 'Lois Lowry': 3.88,
 'C.S. Lewis': 3.88,
 'Audrey Niffenegger': 3.88,
 'George R.R. Martin': 3.88,
 'Elizabeth Gilbert': 3.88,
 'Rick Riordan': 3.88,
 'Louisa May Alcott': 3.88,
 'Charlotte BrontÃ«': 3.88,
 'Nicholas Sparks': 3.88,
 'Yann Martel': 3.88,
 'Sara Gruen': 3.88,
 'Markus Zusak': 3.88,
 'Ray Bradbury': 3.88,
 'Shel Silverstein': 3.88,
 'Cassandra Clare': 3.88,
 'Christopher Paolini': 3.88,
 'Douglas Adams': 3.88,
 'Aldous Huxley': 3.88,
 'Sue Monk Kidd': 3.88,
 'Mark Twain': 3.88,
 'E.B. White': 3.88,
 'Mark Haddon': 3.88,
 'Paula Hawkins': 3.88,
 'Philip Pullman': 3.88,
 'Emily BrontÃ«': 3.88,
 'Jodi Picoult': 3.88,
 'Kurt Vonnegut Jr.': 3.88,
 'Margaret Mitchell': 3.88,
 'Stephen Chbosky': 3.88,
 'Orson Scott Card': 3.88,
 'Mary Wollstonecraft Shelley': 3.88,
 'Stephen King': 3.88,
 'Helen Fielding': 3.88,
 'Louis Sachar': 3.88,
 'Lauren Weisberger': 3.88,
 'Homer': 3.88,
 'Antoine de Saint-ExupÃ©ry': 3.88,
 'Jeannette Walls': 3.88,
 'Jon Krakauer': 3.88,
 'Charles Dickens': 3.88,
 'Michael Crichton': 3.88,
 'John Grisham': 3.88,
 'Elie Wiesel': 3.88,
 'William Goldman': 3.88,
 'S.E. Hinton': 3.88,
 'James Dashner': 3.88,
 'Steven D. Levitt': 3.88,
 'Frances Hodgson Burnett': 3.88,
 'Gabriel GarcÃ\xada MÃ¡rquez': 3.88,
 'Oscar Wilde': 3.88,
 'Bram Stoker': 3.88,
 ' Mary GrandPrÃ©': 3.88,
 ' Erich Fromm': 3.88,
 ' Eleanor Roosevelt': 3.88,
 ' Reg Keeland': 3.88,
 ' Robert           Jackson': 3.88,
 ' Alan R. Clarke': 3.88,
 ' Michael Mason': 3.88,
 ' John Seelye': 3.88,
 ' Garth Williams': 3.88,
 ' Richard J. Dunn': 3.88,
 ' Percy Bysshe Shelley': 3.88,
 ' Tony Tanner': 3.88,
 ' Louis Sachar': 3.88,
 ' Robert Fagles': 3.88,
 ' Richard Howard': 3.88,
 ' Richard Maxwell': 3.88,
 ' Marion Wiesel': 3.88,
 ' Stephen J. Dubner': 3.88,
 ' Gregory Rabassa': 3.88,
 ' Jeffrey Eugenides': 3.88,
 ' Nina Auerbach': 3.88,
 ' CelÃ¢l Ã\x9cster': 3.88,
 ' B.M. Mooyaart-Doubleday': 3.88,
 ' Rufus Beck': 3.88,
 ' Guy Cardwell': 3.88,
 ' Rosemary Wells': 3.88,
 ' Maurice Hindle': 3.88,
 ' Ros Ballaster': 3.88,
 ' E.V. Rieu': 3.88,
 ' Dom Marcos Barbosa': 3.88,
 ' Hablot Knight Browne': 3.88,
 ' David J. Skal': 3.88,
 ' FrÃ©dÃ©ric Mugler': 3.88,
 ' Melina Karakosta': 3.88,
 ' Bernard Knox': 3.88}

In [230]:
#Lastly we find the author with the highest avg. rating
aut_avg_max = max(dict_authors, key=dict_authors.get)
aut_avg_max
print('The author with the highest avg. rating is '+aut_avg_max+' with a rating of '+str(dict_authors[aut_avg_max]))

The author with the highest avg. rating is E.L. James with a rating of 4.22